---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFailuresPreprocessor
source: html/b70ac4c0-ffc7-cdcd-c189-bc6cba54e58f.htm
---
# IFailuresPreprocessor Methods

This method is called when there have been failures found at the end of a transaction and Revit is about to start processing them.